xmlsamples/DAS_Query/PROD-TW-GetDeliveryServices-AIS-TWD00.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
         <device>
            <id>WUCMUSER</id>
            <type>DMAWEB</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>AGENT</name>
            <version>9500</version>
         </channel>
         <foreign_remote_system>
            <identifier>WGWDTWD000P</identifier>
            <reference_no>29997000141024240</reference_no>
            <counter_id>TWD00WDPFP1A</counter_id>
         </foreign_remote_system>
         <client_id>H2H</client_id>
         <name>GetDeliveryServices</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>TW USD</queryfilter2>
            <queryfilter3>VN VND</queryfilter3>
            <queryfilter4>ALL</queryfilter4>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>