xmlsamples/DAS_Query/PROD-SA-GetCascadeList-AIS-SAW54.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:h2h-das-request>
            <device>
                <id>H2H</id>
                <type>RETAIL</type>
            </device>
            <channel>
                <type>H2H</type>
                <name>SAW54WAL001A</name>
                <version>9500</version>
            </channel>
            <foreign_remote_system>
                <identifier>WGBSSAW540P</identifier>
                <reference_no>WU15101020038813</reference_no>
                <counter_id>SAW54WAL001A</counter_id>
            </foreign_remote_system>
         <name>GetCascadeList</name>
         <filters>
            <queryfilter1>en</queryfilter1>
            <queryfilter2>CMBRURUB</queryfilter2>
         </filters>
      </xrsi:h2h-das-request>
   </soapenv:Body>
</soapenv:Envelope>